<?php
    //тия са като import в Java или using в С#
    require_once "Luck.php";
    require_once "FortuneCookie.php";
    require_once "Jar.php";

    //проверяваме дали в пост заявката, която сме изпратили сме сетнали нещо с име "btn"
    if (isset($_POST["btn"])) {

        //създаваме нов буркан
        $jar = new Jar();

        //в буркана добавяме нова бисквитка с ново късметче със това съобщение
        $jar->add(new FortuneCookie(new Luck("some message")));
        
        //казваме на тази променлива да стане равна на изтеглена бисквитка, която сме отворили и сме прочели късметчето ѝ
        $message = $jar->draw()->open()->read();

        //принципно тук може да има цикъл, който да добавя повече от една бисквитка, но дори с това пак може да се види резултата
    }
    
    //извикваме view-то да си сложи html-a тук (все пак това ни е web view-то)
    require_once "view.php"
?>